content/posts/2024-10-12-why-i-make-my-own-flashcards.md
+++
title = "Why I make my own flashcards"
author = ["Joshua Rasband"]
date = 2024-10-12
tags = ["learning"]
draft = false
+++

During medical school, I started using the Anki spaced repetition system to put
large amounts of knowledge into my long-term memory. At first, I used decks made
by other students. Eventually, I found that I preferred creating my own
flashcards over using decks of pre-made flashcards.


## Focus {#focus}

Making my own flashcards is a significant use of time and effort. At first
blush, that sounds like it's a disadvantage, but it can also be framed as a
benefit. Because there is a non-zero cost to making my flashcards, it
incentivizes me to make the minimum number of flashcards necessary and no more.
I found that before I started making my own cards, I was tempted to download
more decks than I reasonably had time to study. The cost incurred by making my
own cards helps me foucs my energies on just the facts that I want to remember.


## Ownership {#ownership}

Because I make my own flashcards, I have a deeper sense of accountability for my
study. When I see a "bad" flashcard (e.g. one that is poorly worded or
ambiguous) I know that it's my fault and I need to fix it. When using a deck
made by someone else, it's easier to ignore the card and keep studying without
improving anything. The knowledge that my flashcards are fully my responsibility
helps me keep iterating and making better and better cards.


## Schema construction {#schema-construction}

The process of making flashcards helps me construct a schema into which I can
place facts. When I make flashcards, I have to ask myself what the most
important things to know are. As I organize my notes, it encourages me to think
about the relationships between concepts---how they are similar, how they are
different. By making flashcards, I give myself time to think about the facts I'm
studying and how they are related---something I wouldn't be forced to do if I
were to rely soley on decks made by other people.
